src/main/resources/xml/accommodationSalesComponentServicePort/unshareAccommodations/unshareAccommodations.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.service.resmanagement.wdw.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ejb:unshareAccommodations>
            <request>
                <shareChains/>
                <unsharedAccommodations>
                    <unSharedRoomDetail>
                        <bookingDate>?</bookingDate>
                        <guaranteeStatus>?</guaranteeStatus>
                        <inventoryStatus>?</inventoryStatus>
                        <overideFreeze>?</overideFreeze>
                        <packageCode>?</packageCode>
                        <rateDetails>
                            <additionalCharge>?</additionalCharge>
                            <additionalChargeOverridden>?</additionalChargeOverridden>
                            <basePrice>?</basePrice>
                            <date>?</date>
                            <dayCount>?</dayCount>
                            <overidden>?</overidden>
                            <shared>?</shared>
                            <netPrice>?</netPrice>
                            <pointsValue>?</pointsValue>
                        </rateDetails>
                        <resortCode>?</resortCode>
                        <resortPeriod>
                            <endDate>?</endDate>
                            <startDate>?</startDate>
                        </resortPeriod>
                        <roomReservationDetail>
                            <guestReferenceDetails>
                                <age>?</age>
                                <ageType>?</ageType>
                                <guest>
                                    <firstName>?</firstName>
                                    <lastName>?</lastName>
                                    <middleName>?</middleName>
                                    <partyId>?</partyId>
                                    <doNotMailIndicator>?</doNotMailIndicator>
                                    <doNotPhoneIndicator>?</doNotPhoneIndicator>
                                    <dclGuestId>?</dclGuestId>
                                    <guestId>?</guestId>
                                    <active>?</active>
                                    <dob>?</dob>
                                </guest>
                                <purposeOfVisit>?</purposeOfVisit>
                                <correlationID>?</correlationID>
                            </guestReferenceDetails>
                        </roomReservationDetail>
                        <roomTypeCode>?</roomTypeCode>
                        <rsrReservation>?</rsrReservation>
                        <travelComponentGroupingId>?</travelComponentGroupingId>
                        <travelComponentId>?</travelComponentId>
                        <travelStatus>?</travelStatus>
                        <shared>?</shared>
                        <specialNeedsRequested>?</specialNeedsRequested>
                    </unSharedRoomDetail>
                    <guestDetail/>
                    <travelPlanSegmentId>?</travelPlanSegmentId>
                </unsharedAccommodations>
                <unsharedAccommodations>
                    <unSharedRoomDetail>
                        <bookingDate>?</bookingDate>
                        <guaranteeStatus>?</guaranteeStatus>
                        <inventoryStatus/>
                        <overideFreeze>?</overideFreeze>
                        <packageCode>?</packageCode>
                        <rateDetails>
                            <additionalCharge>?</additionalCharge>
                            <additionalChargeOverridden>?</additionalChargeOverridden>
                            <basePrice>?</basePrice>
                            <date>?</date>
                            <dayCount>?</dayCount>
                            <overidden>?</overidden>
                            <shared>?</shared>
                            <netPrice>?</netPrice>
                            <pointsValue>?</pointsValue>
                        </rateDetails>
                        <resortCode>?</resortCode>
                        <resortPeriod>
                            <endDate>?</endDate>
                            <startDate>?</startDate>
                        </resortPeriod>
                        <roomReservationDetail>
                            <guestReferenceDetails>
                                <age>?</age>
                                <ageType>?</ageType>
                                <guest>
                                    <firstName>?</firstName>
                                    <lastName>?</lastName>
                                    <middleName>?</middleName>
                                    <partyId>?</partyId>
                                    <doNotMailIndicator>?</doNotMailIndicator>
                                    <doNotPhoneIndicator>?</doNotPhoneIndicator>
                                    <dclGuestId>?</dclGuestId>
                                    <guestId>?</guestId>
                                    <active>?</active>
                                    <dob>?</dob>
                                </guest>
                                <purposeOfVisit>?</purposeOfVisit>
                                <correlationID>?</correlationID>
                            </guestReferenceDetails>
                        </roomReservationDetail>
                        <roomTypeCode>?</roomTypeCode>
                        <rsrReservation>?</rsrReservation>
                        <travelComponentGroupingId>?</travelComponentGroupingId>
                        <travelComponentId>?</travelComponentId>
                        <travelStatus>?</travelStatus>
                        <shared>?</shared>
                        <locationId>?</locationId>
                        <specialNeedsRequested>?</specialNeedsRequested>
                    </unSharedRoomDetail>
                    <guestDetail/>
                    <travelPlanSegmentId>?</travelPlanSegmentId>
                </unsharedAccommodations>
            </request>
            <serviceContext>
                <addressRole>?</addressRole>
                <conversationId>?</conversationId>
                <messageId>?</messageId>
                <party1Id>?</party1Id>
                <party1Type>?</party1Type>
                <party2Id>?</party2Id>
                <party2Type>?</party2Type>
                <pathHostName>?</pathHostName>
                <pathId>?</pathId>
                <principalId>?</principalId>
                <principalMethod>?</principalMethod>
                <principalRole>?</principalRole>
                <principalUri>?</principalUri>
                <principalValue>?</principalValue>
                <requestTimeStamp>?</requestTimeStamp>
                <toAddressRole>?</toAddressRole>
                <userName>?</userName>
            </serviceContext>
        </ejb:unshareAccommodations>
    </soapenv:Body>
</soapenv:Envelope>